{
  "posts": [
    {
      "title": "Vehicle miniatures are the favorites not only of children but also of many adults and children as well",
      "author": "Donny Van de Beek",
      "authorInfo": "Daniel Owen James is a professional footballer who plays as a winger for Premier League club Leeds United and the Wales national team. James made his professional debut for Swansea City in February 2018, and signed for Manchester United in June 2019.",
      "category": "business",
      "date": "March 15, 2018",
      "hashtags": "#Cars #Children",
      "content": "Now blessings light on him that first invented this same sleep: it covers a man all over, thoughts and all, like a cloak; 'Tis meat for the hungry, drink for the thirsty, heat for the cold, and cold for the hot. 'Tis the current coin that purchases all the pleasures of the world cheap; and the balance that sets the king and the shepherd, the fool and the wise man even. There is only one thing that I dislike in sleep; 'Tis that it resembles death.” ­- Don Quixote“I have to practice staying ali...",
      "id": 1
    },
    {
      "title": "How a good team can positively influence your work and improve",
      "author": "Dustin Trafford",
      "authorInfo": "Jadon Malik Sancho is an English professional footballer who plays as a winger for Premier League club Manchester United and the England national team. He is known for his trickery, pace and use of feints in one-on-one situations. Nice player all around",
      "category": "Crypto",
      "date": "September 18, 2019",
      "hashtags": "#Lazy #Chill #Nice",
      "content": "Sejong swept his books off the shelf. Rain pelted the world outside. The king opened one of his many works, the spine of it splitting under his force, and read off a page. Nongsa jikseol, methods of cultivation in agriculture. A guidebook to farming in Korea’s geography. Nice new text.",
      "id": 2
    },
    {
      "title": "Successful analysis can become the key to your business success",
      "author": "Marcus Rashford",
      "authorInfo": "Marcus Rashford MBE is an English professional footballer who plays as a forward for Premier League club Manchester United and the England national team.",
      "category": "business",
      "date": "October 12, 2019",
      "hashtags": "#Aesthetic #Fun",
      "content": "The noise is assaulting. Weeks of daytime solitude have left me unprepared for the hustle and bustle of the room. A handful of mothers sit on the floor playing blocks with their toddlers. A group of preschoolers squabble over a pram. Two mothers snatch a conversation, while one ignores the snotty nosed toddler clinging to her leg.",
      "id": 3
    },
    {
      "title": "Good partnerships can help your company achieve better results",
      "author": "Harvey Barnes",
      "authorInfo": "Harvey Lewis Barnes is an English professional footballer who plays as a winger for Premier League club Leicester City and the England national team.",
      "category": "business",
      "date": "August 5, 2018",
      "hashtags": "#DIY #Special",
      "content": "The noise is assaulting. Weeks of daytime solitude have left me unprepared for the hustle and bustle of the room. A handful of mothers sit on the floor playing blocks with their toddlers. A group of preschoolers squabble over a pram. Two mothers snatch a conversation, while one ignores the snotty nosed toddler clinging to her leg.",
      "id": 4
    },
    {
      "title": "Methods that can help you use your credit card more safely",
      "author": "Jamie Vardy",
      "authorInfo": "Jamie Richard Vardy is an English professional footballer who plays as a striker for Premier League club Leicester City. Vardy has also played for the England national team.",
      "category": "business",
      "date": "June 26, 2019",
      "hashtags": "#Football #Fashion",
      "content": "The noise is assaulting. Weeks of daytime solitude have left me unprepared for the hustle and bustle of the room. A handful of mothers sit on the floor playing blocks with their toddlers. A group of preschoolers squabble over a pram. Two mothers snatch a conversation, while one ignores the snotty nosed toddler clinging to her leg.",
      "id": 5
    },
    {
      "title": "See some alternatives to bitcoin that can be a good investment",
      "author": "James Maddison",
      "authorInfo": "James Daniel Maddison is an English professional footballer who plays as an attacking midfielder for Premier League club Leicester City and the England national team. Maddison began his career with Coventry City before joining Norwich City in 2016.",
      "category": "bitcoin",
      "date": "May 23, 2018",
      "hashtags": "#Bike #Senior",
      "content": "The noise is assaulting. Weeks of daytime solitude have left me unprepared for the hustle and bustle of the room. A handful of mothers sit on the floor playing blocks with their toddlers. A group of preschoolers squabble over a pram. Two mothers snatch a conversation, while one ignores the snotty nosed toddler clinging to her leg.",
      "id": 6
    },
    {
      "title": "aasdfasdf a",
      "author": "Lol",
      "authorInfo": "Nice guy here",
      "category": "New",
      "date": "26/06/2020",
      "hashtags": "#Jason",
      "content": "asdafdjk dfklj akljf kl dalkjd lhalg hlfkadjg fdskj hgkjadfh jkahjl hdjkh jkahdjlg hdsajkldjs ;lg agkj adklh d;gladsfklgj klahj hajkg hkljafsh gkjldha jkldhsgkjl hadsjkldh gkjladshg jkhasdjk hgkjh kjadh kjghdjklhgkjlah kjadlshg kjadh hgahgjkhdfjka hgkjah kjg ag akjhg jkldhajhjg jdkah kjghjkdhjk hgdkjalh kjadhsgjkdhkjgh akjlgh kdjh gjkh jk djkahgjkdh akjghhjaopigorgitp reitp oeriup u,mbvk lnbvireut oprhnj bvjiorjb bm,nfb ioughp eripoerkjopaj mnbkldfn bierug nbken beoriug uroptreui pbnlmdnbslkshgioyu0eruiy bmkbljipsdfgio uyepioj hiepru erio poiuyngkld fgosdgohsdgoh.",
      "id": 7
    },
    {
      "title": "A cryptocurrency, crypto-currency, or crypto is a collection of binary data which is designed to work as a medium of exchange.",
      "author": "Self Help Guru",
      "authorInfo": "I'm a fraud just so you know that. I'll dupe you into buying my course and ultimately get rich from that only.",
      "category": "Crypo",
      "date": "04/12/2021",
      "hashtags": "#Crypto #Rich #Lol",
      "content": "A cryptocurrency, crypto-currency, or crypto is a collection of binary data which is designed to work as a medium of exchange. Individual coin ownership records are stored in a ledger, which is a computerized database using strong cryptography to secure transaction records, to control the creation of additional coins, and to verify the transfer of coin ownership.[1][2][3] Cryptocurrencies are generally fiat currencies, as they are not backed by or convertible into a commodity.[4] Some crypto schemes use validators to maintain the cryptocurrency. In a proof-of-stake model, owners put up their tokens as collateral. In return, they get authority over the token in proportion to the amount they stake. Generally, these token stakers get additional ownership in the token over time via network fees, newly minted tokens or other such reward mechanisms.[5]",
      "id": 8
    },
    {
      "title": "fasfa sf",
      "author": "a fdasf a",
      "authorInfo": " afdag gagda gda g",
      "category": "sda",
      "date": "fsadf",
      "hashtags": "fasd fsda f a",
      "content": "In 1983, the American cryptographer David Chaum conceived an anonymous cryptographic electronic money called ecash.[9][10] Later, in 1995, he implemented it through Digicash,[11] an early form of cryptographic electronic payments which required user software in order to withdraw notes from a bank and designate specific encrypted keys before it can be sent to a recipient. This allowed the digital currency to be untraceable by the issuing bank, the government, or any third party.\n\nIn 1996, the National Security Agency published a paper entitled How to Make a Mint: the Cryptography of Anonymous Electronic Cash, describing a Cryptocurrency system, first publishing it in an MIT mailing list[12] and later in 1997, in The American Law Review (Vol. 46, Issue 4).[13]\n\nIn 1998, Wei Dai published a description of \"b-money\", characterized as an anonymous, distributed electronic cash system.[14] Shortly thereafter, Nick Szabo described bit gold.[15] Like bitcoin and other cryptocurrencies that would follow it, bit gold (not to be confused with the later gold-based exchange, BitGold) was described as an electronic currency system which required users to complete a proof of work function with solutions being cryptographically put together and published.\n\nIn 2009, the first decentralized cryptocurrency, bitcoin, was created by presumably pseudonymous developer Satoshi Nakamoto. It used SHA-256, a cryptographic hash function, in its proof-of-work scheme.[16][17] In April 2011, Namecoin was created as an attempt at forming a decentralized DNS, which would make internet censorship very difficult. Soon after, in October 2011, Litecoin was released. It used scrypt as its hash function instead of SHA-256. Another notable cryptocurrency, Peercoin, used a proof-of-work/proof-of-stake hybrid.[18]\n\nOn 6 August 2014, the UK announced its Treasury had commissioned a study of cryptocurrencies, and what role, if any, they could play in the UK economy. The study was also to report on whether regulation should be considered.[19] Its final report was published in 2018,[20] and it issued a consultation on cryptoassets and stablecoins in January 2021.[21]\n\nIn June 2021, El Salvador became the first country to accept Bitcoin as legal tender, after the Legislative Assembly had voted 62–22 to pass a bill submitted by President Nayib Bukele classifying the cryptocurrency as such.[22]\n\nIn August 2021, Cuba followed with Resolution 215 to accept Bitcoin as legal tender, which will circumvent U.S. sanctions.[23]\n\nIn September 2021, the government of China, the single largest market for cryptocurrency, declared all cryptocurrency transactions illegal, completing a crackdown on cryptocurrency that had previously banned the operation of intermediaries and miners within China.[24]",
      "id": 9
    }
  ],
  "comments": [
    {
      "body": "Yo bro",
      "author": "MyName",
      "postId": 2,
      "id": 9
    },
    {
      "body": "How are you Avengers",
      "author": "Hulk",
      "postId": 2,
      "id": 10
    },
    {
      "body": "New comment",
      "author": "Jason",
      "postId": 1,
      "id": 11
    }
  ],
  "profile": {
    "name": "typicode"
  }
}